load-tests/population-calculation-load-test.yml
# Population Calculation Load Test
# Tests batch quality measure calculation performance
# Target: >1000 patients/minute with all measures

config:
  target: 'http://localhost:8087'
  phases:
    # Single calculation test
    - duration: 60
      arrivalRate: 1
      name: "Baseline single calculations"

    # Small batch test
    - duration: 120
      arrivalRate: 2
      name: "Small batch (100 patients)"

    # Medium batch test
    - duration: 180
      arrivalRate: 1
      name: "Medium batch (1000 patients)"

    # Large batch test
    - duration: 300
      arrivalRate: 1
      name: "Large batch (10000 patients)"

  payload:
    path: "./test-data/measure-definitions.json"

  defaults:
    headers:
      Content-Type: "application/json"
      X-Tenant-ID: "tenant-load-test"
      Authorization: "Bearer {{ $env.TEST_JWT_TOKEN }}"

  ensure:
    # Batch processing should complete
    maxErrorRate: 0
    # Single patient measure calculation should be fast
    p95: 5000  # 5 seconds for single patient

  plugins:
    metrics-by-endpoint:
      stripQueryString: true
    expect: {}

scenarios:
  - name: "Single Patient Quality Measures"
    weight: 40
    flow:
      # Calculate all measures for one patient
      - post:
          url: "/quality-measure/api/v1/results/calculate"
          json:
            patientId: "patient-{{ $randomInt(1, 1000) }}"
            measureIds:
              - "CMS125"  # Breast cancer screening
              - "CMS134"  # Diabetes: HbA1c control
              - "CMS2"    # Depression screening
              - "CMS165"  # Blood pressure control
              - "CMS122"  # Diabetes: Eye exam
          capture:
            - json: "$.jobId"
              as: "jobId"
          expect:
            - statusCode: 202  # Accepted (async)

      # Poll for completion
      - loop:
          - get:
              url: "/quality-measure/api/v1/results/job/{{ jobId }}"
              expect:
                - statusCode: 200
          - think: 2
          ifTrue: "{{ $response.body.status === 'COMPLETED' }}"
          count: 10

  - name: "Batch Population Calculation"
    weight: 30
    flow:
      # Trigger population-wide calculation
      - post:
          url: "/quality-measure/api/v1/population/calculate"
          json:
            tenantId: "tenant-load-test"
            fhirServerUrl: "http://localhost:8085/fhir"
            measureIds:
              - "CMS125"
              - "CMS134"
              - "CMS2"
            batchSize: 100
            maxPatients: "{{ $randomInt(100, 1000) }}"
          capture:
            - json: "$.jobId"
              as: "batchJobId"
          expect:
            - statusCode: 202

      # Monitor progress
      - loop:
          - get:
              url: "/quality-measure/api/v1/population/job/{{ batchJobId }}/status"
              expect:
                - statusCode: 200
                - hasProperty: "totalPatients"
                - hasProperty: "completedCalculations"
                - hasProperty: "throughput"
              capture:
                - json: "$.throughput"
                  as: "throughput"
          - think: 10
          ifTrue: "{{ $response.body.status !== 'COMPLETED' }}"
          count: 60  # Max 10 minutes

      # Verify throughput target met
      - log: "Throughput: {{ throughput }} patients/minute"

  - name: "Patient Health Score Calculation"
    weight: 20
    flow:
      # Trigger health score calculation
      - post:
          url: "/quality-measure/patient-health/health-score/{{ $randomPatientId() }}/calculate"
          expect:
            - statusCode: 200
            - hasProperty: "overallScore"
            - hasProperty: "physicalHealthScore"
            - hasProperty: "mentalHealthScore"

      # Verify score is reasonable (0-100)
      - expect:
          - json: "$.overallScore"
            gte: 0
            lte: 100

  - name: "Care Gap Analysis"
    weight: 10
    flow:
      # Get care gaps for patient
      - get:
          url: "/quality-measure/patient-health/care-gaps/{{ $randomPatientId() }}"
          expect:
            - statusCode: 200
            - contentType: "application/json"

      # If gaps exist, address one
      - post:
          url: "/quality-measure/patient-health/care-gaps/{{ $response.body[0].id }}/address"
          json:
            notes: "Load test care gap closure"
            addressedBy: "load-test-user"
          ifTrue: "{{ $response.body.length > 0 }}"
          expect:
            - statusCode: 200

# Helper functions
functions:
  randomPatientId:
    - "load-test-patient-{{ $randomInt(1, 1000) }}"

  randomInt:
    - "{{ $randomInt(1, 1000) }}"